app/views/tasks/create.js.erb


document.getElementById("<%=@category.id%>").insertAdjacentHTML("beforeend","<%= j render 'task', task: @task %>");
---
INSERT INTO "tasks" ("created_at", "updated_at", "title", "category_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-08-27 21:27:43.758617"], ["updated_at", "2019-08-27 21:27:43.758617"], ["title", "dsd"], ["category_id", 2]]