app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
  	@emails = Email.all

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @email = Email.find(params[:id])

INSERT INTO "emails" ("objet", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["objet", "senaida@gorczanyheathcote.org"], ["body", "Go ahead, make my day."], ["created_at", "2019-08-29 20:17:59.566311"], ["updated_at", "2019-08-29 20:17:59.566311"]]
---
  def create
  	 @email=Email.create!(objet: Faker::Internet.email, body: Faker::Movie.quote)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 1]]
---
  def destroy
    @email = Email.find(params[:id])
    @email.destroy

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-08-30 00:24:32.731722"], ["id", 50]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-08-30 00:23:33.650370"], ["id", 48]]
---
  def update
    @email = Email.find(params[:id])
    if (@email.read == true || @email.read == nil)
      @email.read = false
      @email.save
    else
    @email.read = true
    @email.save