app/controllers/tasks_controller.rb

  def new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category
    if @task.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "category_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-08-27 20:59:04.725786"], ["updated_at", "2019-08-27 20:59:04.725786"], ["title", "Rolland"], ["category_id", 1]]

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
    if (params[:rol]=="1")
        @task.status = true
        @task.save
    else
    @task.status = false
    @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "status" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2019-08-29 14:31:46.233027"], ["status", true], ["id", 68]]
UPDATE "tasks" SET "updated_at" = $1, "status" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2019-08-29 14:32:28.192613"], ["status", false], ["id", 71]]