app/views/emails/create.js.erb

document.getElementsByTagName("tbody")[0].insertAdjacentHTML("beforeend","<%= j render 'creat_ajax', email: @email %>");
---
INSERT INTO "emails" ("objet", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["objet", "gisele@kerluke.name"], ["body", "All right, Mr. DeMille, I'm ready for my closeup."], ["created_at", "2019-08-29 18:37:31.341906"], ["updated_at", "2019-08-29 18:37:31.341906"]]